"use client";

import React from "react"; 

const TermsAndConditionsContent: React.FC = () => {
  return (
    <>
      <div className="text-container ptb-100">
        <div className="container">
          <h3>اتفاقية الاستخدام</h3>

          <p>
           نهدف الى تحديد القواعد والشروط التى يجب على المستخدمين الالتزام بها اثناء استخدام خدمات شركتنا فيرجي قراءة هذة الشروط بعناية قبل استخدام الخدمات المقدمة من شركتنا
          </p>

          <h3>الموافقة على شروط الاستخدام</h3>
          <p>
             باستخدام خدماتنا فانك توافق على تطبيق جميع الشروط الواردة فى هذة الصفحة فاذا كنت لا توافق على اى من هذة الشروط يجب عليك مراجعتنا قبل استخدام الخدمة ونحن نحتفظ بالحق فى تعديل هذة السياسة فى اى وقت وسوف يتم اشعارك بالتغييرات عبر البريد الالكتروني او من خلال اشعار على موقعنا  
          </p>
          <h3>الاستضافة والاداء</h3>
          <p>
         نلتزم بتوفير خدمات الاستضافة والسيرفرات الافتراضية والسيرفرات الكاملة ونحتفظ بالحق فى تحديد
         <br></br>المساحة التخذينية وحجم النطاق الترددي فى مختلف الخطط
         <br></br>أي استخدام مفرط للموارد الذي قد يؤثر على أداء الخوادم أو يسبب تعطيل الخدمة للمستخدمين الآخرين
         <br></br>ملاحظة: في حالة الاستخدام المفرط أو المخالف لهذه القواعد، قد نقوم بتقييد أو تعليق الخدمة حتى يتم حل المشكلة
          </p>

          <h3>حماية البيانات والخصوصية</h3>
          <p>
          نحن نأخذ أمن وخصوصية بياناتك على محمل الجد. نلتزم بحماية البيانات الشخصية التي تقدمها لنا وفقًا لسياسة الخصوصية الخاصة بنا. ومع ذلك، يجب عليك اتخاذ الاحتياطات اللازمة لحماية حسابك وكلمات المرور الخاصة بك
          </p>
          استخدام الحسابات: أنت مسؤول عن الحفاظ على سرية حسابك وكلمة المرور الخاصة بك
          <br></br>البيانات المخزنة: لا نتحمل المسؤولية عن فقدان البيانات التي يتم تخزينها على الخوادم الخاصة بك، لذا نوصي بإجراء نسخ احتياطية بانتظام.
          <h3>الدفع والفواتير</h3>
          <p>
          طرق الدفع: تقدم الشركة خيارات متعددة للدفع عبر الإنترنت. يتم تحديد الأسعار في خطة الخدمة التي تختارها.<br></br>
تجديد الخدمات: تتطلب خدمات الاستضافة والتصميم البرمجة تجديدات دورية (شهريًا أو سنويًا). يجب عليك دفع الفواتير في الوقت المحدد لتجنب انقطاع الخدمة.<br></br>
سياسة الإلغاء: يحق للمستخدمين إلغاء الخدمة في أي وقت، ولكن يجب عليك التحقق من سياسة الاسترداد أو الإلغاء المرتبطة بالخدمة التي اشتريتها.
          </p>
          <h3>حقوق الملكية الفكرية</h3>
          <p>
          حقوق تصميم المواقع والتطبيقات: في حال تم تصميم وتطوير مواقع أو تطبيقات مخصصة، فإن حقوق ملكية العمل تبقى ملكًا لك كعميل بمجرد اكتمال الدفع. ومع ذلك، تحتفظ الشركة بحق استخدام بعض التصاميم والأكواد لأغراض دعائية.<br></br>
          استخدام المحتوى: إذا كنت تستخدم محتوى من مواقع أخرى أو تضمّن ذلك حقوق ملكية أخرى، فإنك تتحمل المسؤولية القانونية لضمان الحصول على التراخيص المناسبة.

          </p>
          <h3> مسؤولية الشركة</h3>
          <p>
          نحن نبذل قصارى جهدنا لتوفير خدمة متميزة وآمنة، ولكننا لا نتحمل المسؤولية عن:<br></br>

أي انقطاع أو خلل في الخدمة قد ينتج عن ظروف قاهرة أو تقنيات خارجة عن إرادتنا.<br></br>
الأضرار الناتجة عن استخدام غير صحيح للخدمة أو انتهاك أي من الشروط الموضوعة في هذه السياسة.<br></br>
أي خسائر مالية أو أضرار قد تحدث نتيجة لتعطل المواقع أو فقدان البيانات المخزنة.<br></br>


          </p>
          <h3> الإنهاء والتعليق</h3>
          <p>
          نحتفظ بالحق في تعليق أو إنهاء حسابات المستخدمين الذين ينتهكون شروط الاستخدام أو ينخرطون في نشاطات غير قانونية أو ضارة. في حالة الإنهاء، سيتم إعلام المستخدم عبر البريد الإلكتروني، وقد يتم حذف جميع البيانات والمحتوى المرتبط بالحساب


          </p>
          <h3>  تعديل شروط الاستخدام</h3>
          <p>
          تحتفظ الشركة بالحق في تعديل هذه السياسة في أي وقت. ستكون التعديلات سارية المفعول فور نشرها على الموقع أو إشعار المستخدمين عبر البريد الإلكتروني. من مسؤولية المستخدمين متابعة التغييرات في هذه السياسة

          </p>
          <h3>  القوانين الحاكمة وحل النزاعات</h3>
          <p>
          تخضع هذه السياسة للقوانين المحلية في جمهورية مصر العربية، وأي نزاع قد ينشأ بين الطرفين سيتم حلّه بشكل ودي أولاً، وفي حالة عدم التوصل إلى حل، يتم اللجوء إلى التحكيم أو القضاء المحلي
          </p>

          <br></br><p>هذه سياسة الاستخدام التي تهدف إلى توفير بيئة آمنة واحترافية لجميع العملاء. إذا كان لديك أي استفسارات أو أسئلة حول هذه السياسة، لا تتردد في التواصل مع فريق الدعم الفني لدينا</p>
        </div>
      </div>
    </>
  );
};

export default TermsAndConditionsContent;
