"use client";

import React from "react"; 

const PrivacyPolicyContent: React.FC = () => {
  return (
    <>
    <div className="text-container ptb-100">
      <div className="container">
        <h3>سياسة الخصوصية</h3>

        <p>
        نحن في ENSEGYPT نلتزم بحماية خصوصيتك وضمان سرية بياناتك الشخصية. تهدف سياسة الخصوصية هذه إلى توضيح كيفية جمع واستخدام وحماية المعلومات التي تقدمها عند استخدام خدماتنا المتعلقة بالاستضافة، التصميم، والبرمجة. برجاء قراءة سياسة الخصوصية هذه بعناية لفهم ممارساتنا المتعلقة بالمعلومات التي نقوم بجمعها وكيفية معالجتها.        </p>

        <h3> المعلومات التي نقوم بجمعها</h3>
        <p>
        نحن نجمع نوعين رئيسيين من المعلومات عند استخدامك لخدماتنا:

المعلومات الشخصية:
التسجيل: عند إنشاء حساب معنا أو الاشتراك في خدماتنا، قد يُطلب منك تقديم معلومات شخصية مثل الاسم الكامل، عنوان البريد الإلكتروني، رقم الهاتف، عنوان الدفع، وتفاصيل أخرى.<br></br>
التفاعل مع الدعم: عند التواصل مع فريق الدعم الفني أو الاستفسار عن خدماتنا، قد نقوم بتخزين معلومات المحادثات والمراسلات لتقديم المساعدة وتحسين خدماتنا.<br></br>
المعلومات غير الشخصية:<br></br>
بيانات التصفح: نقوم بجمع معلومات غير شخصية تتعلق باستخدامك لموقعنا الإلكتروني مثل نوع المتصفح، عنوان IP، الصفحات التي زرتها، الوقت الذي قضيته في الموقع، والمعلومات المتعلقة بالأنظمة التشغيلية.<br></br>
ملفات تعريف الارتباط (Cookies): نستخدم ملفات تعريف الارتباط لتحسين تجربتك على الموقع. تساعدنا هذه الملفات في تتبع الأنماط وتحليل حركة المرور وتخصيص المحتوى وفقًا لاحتياجاتك.        </p>
        <h3>حماية البيانات</h3>
        <p>
        نحن نلتزم بحماية معلوماتك الشخصية من الوصول غير المصرح به أو التعديل أو الكشف أو الإتلاف. نستخدم تقنيات الأمان مثل التشفير، الجدران النارية، وعمليات الأمان المتقدمة لحماية بياناتك خلال نقلها أو تخزينها.<br></br>

ملاحظة: رغم اتخاذنا كافة التدابير الأمنية، لا يمكن ضمان الأمان الكامل على الإنترنت بسبب الطابع المفتوح للشبكة.
        </p>

        <h3>مشاركة المعلومات مع أطراف ثالثة</h3>
        <p>
        نحن لا نبيع أو نؤجر معلوماتك الشخصية إلى أطراف ثالثة. ومع ذلك، قد نقوم بمشاركة معلوماتك مع بعض الأطراف في الحالات التالية:

مقدمو الخدمة: قد نشارك بياناتك مع شركات تقدم لنا خدمات مثل خدمات الدفع، دعم العملاء، والاستضافة، شريطة أن تلتزم هذه الشركات بمعايير الأمان وحماية الخصوصية.<br></br>
الامتثال للقوانين: قد نكشف عن معلوماتك إذا كان ذلك مطلوبًا بموجب القانون، أو استجابةً لمطالبة قانونية، مثل طلب من الحكومة أو القضاء.<br></br>
الحماية ضد الاحتيال: إذا كان هناك شك في نشاط غير قانوني أو غير مصرح به، قد نكشف عن معلوماتك لحماية أنفسنا أو مستخدمينا.<br></br>
        </p><p>
        استخدام الحسابات: أنت مسؤول عن الحفاظ على سرية حسابك وكلمة المرور الخاصة بك
        <br></br>البيانات المخزنة: لا نتحمل المسؤولية عن فقدان البيانات التي يتم تخزينها على الخوادم الخاصة بك، لذا نوصي بإجراء نسخ احتياطية بانتظام.</p>
        <h3>حقوقك فيما يتعلق بمعلوماتك الشخصية</h3>
        <p>
        لديك عدة حقوق تتعلق بمعلوماتك الشخصية:<br></br>

الحق في الوصول: يمكنك طلب الوصول إلى المعلومات الشخصية التي نحتفظ بها عنك.<br></br>
الحق في التصحيح: إذا كانت هناك معلومات غير دقيقة أو غير مكتملة، يمكنك طلب تصحيحها.<br></br>
الحق في الحذف: يمكنك طلب حذف بياناتك الشخصية في حالة لم تعد بحاجة إليها أو إذا كانت تخالف القوانين المعمول بها.<br></br>
الحق في الاعتراض: إذا كنت لا ترغب في تلقي رسائل تسويقية أو إذا كنت ترغب في إلغاء الاشتراك في بعض خدماتنا.<br></br>
لتمرين أي من هذه الحقوق، يُرجى الاتصال بنا عبر القنوات المخصصة في أسفل الصفحة.<br></br>
        </p>
        <h3>الاحتفاظ بالبيانات</h3>
        <p>
        نحتفظ بمعلوماتك الشخصية فقط للمدة اللازمة لتحقيق الأغراض التي تم جمع البيانات من أجلها، بما في ذلك التزامنا بالقوانين المحلية والممارسات التجارية. سيتم حذف أو إخفاء بياناتك الشخصية عندما تصبح غير ضرورية.

        </p>
        <h3>  تحديثات سياسة الخصوصية</h3>
        <p>
        نحتفظ بالحق في تعديل سياسة الخصوصية هذه في أي وقت لتواكب التغييرات في الممارسات أو التقنيات أو القوانين المعمول بها. ستكون أي تغييرات سارية فور نشرها على هذه الصفحة أو إشعارك بها عبر البريد الإلكتروني. نوصي بمراجعة هذه الصفحة بانتظام لمتابعة أي تحديثات.<br></br>




        </p>
        <h3> روابط إلى مواقع خارجية</h3>
        <p>
        نحتفظ بالحق في تعليق أو إنهاء حسابات المستخدمين الذين ينتهكون شروط الاستخدام أو ينخرطون في نشاطات غير قانونية أو ضارة. في حالة الإنهاء، سيتم إعلام المستخدم عبر البريد الإلكتروني، وقد يتم حذف جميع البيانات والمحتوى المرتبط بالحساب


        </p>
        <h3>  تعديل شروط الاستخدام</h3>
        <p>
        قد يحتوي موقعنا على روابط لمواقع أخرى قد تحتوي على سياسات خصوصية مختلفة. نحن غير مسؤولين عن ممارسات الخصوصية أو محتوى هذه المواقع.
        </p>
      
       

      </div>
    </div>
  </>
  );
};

export default PrivacyPolicyContent;
